#include "stm32f10x.h" // Device heade
#ifndef __ULTRASONIC_H
#define __ULTRASONIC_H
////////////////////////////接线///////////////////////////////////////////////////	
//HC-SR04+ 超声波测距模块与HC-SR04完全兼容，工作电压3V-5.5V
//VCC：+5V
//Trig:Pb7
//Echo:Pb6
//GND:GND脚为此模块作为防盗模块时的开关输出量，测距模块不用此脚！！！
///////////////////////////原理///////////////////////////////////////////////////	
//采用IO（Trig）触发测距，给至少10us的高电平，实际40-50us效果好
//有信号返回，通过IO（Echo）输出一高电平，高电平持续的时间就是超声波从发射到返回的时间
//////////////////////////////////////////////////////////////////////////////////	


#define Speed 340 //超声波传播速度340m/s

float Ultrasonic_Distance(void);
void Ultrasonic_Init(void);

#endif

